perf/spaceNewsNoCache.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 30
      arrivalRate: 3
    - name: firstRamp
      duration: 15
      arrivalRate: 5
      rampTo: 15
    - name: plain
      duration: 40
      arrivalRate: 15
    - name: rampdown
      duration: 30
      arrivalRate: 5
    - name: rest 
      duration: 30
      arrivalRate: 0
    

scenarios:
  - name: Space News No Cache (/space_news_no_cache)
    flow:
      - get:
          url: '/space_news_no_cache'